app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Architecture 101"], ["room_number", 0], ["created_at", "2021-01-13 21:00:01.431995"], ["updated_at", "2021-01-13 21:00:01.431995"]]
---
  def create
    @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    # @student = Student.find(params[:id])
    @school_class = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 3000], ["updated_at", "2021-01-13 21:06:08.299421"], ["id", 3]]
---
  def update
    # @student = Student.find(params[:id])
    # @student.update(params.require(:student).permit(:first_name, :last_name))
    # redirect_to student_path(@student)
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(params.require(:school_class).permit(:title, :room_number))